Обработки/Reports/_ОтчетПоОперациям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОтчетПоОперациям</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеСвойства</Name>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОтчетПоОперациям/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Отчет по операциям",
		"0.55",
		"",
		Истина);
		
	// команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(
		Команды, "СформироватьИОтправитьОтчет", "Формирование отчета и отправка адресату",,  Ложь, "ВызовСерверногоМетода");
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

// Параметры:
//     ИдентификаторКоманды (строка)  - идентификатор команды
//     ПараметрыОбработки (структура) - структура со свойством ДополнительнаяОбработкаСсылка (ссылка на
//        элемент справочника ДополнительныеОтчетыИОбработки, который связан с данной дополнительной обработкой)
//
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки") Тогда
		ЭтотОбъект.ДополнительныеСвойства.Удалить("Ошибки");
	КонецЕсли;
	
	// заполним параметры команды (вариативности команд здесь нет)
	ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(
		ПараметрыОбработки.ДополнительнаяОбработкаСсылка, 
		ИдентификаторКоманды, 
		ПараметрыОбработки.ГруппаПараметров);
		
	ЭтотОбъект.ДополнительныеСвойства.Вставить("Источник", ПараметрыОбработки.ДополнительнаяОбработкаСсылка);

	Если ИдентификаторКоманды <> "СформироватьИОтправитьОтчет" Тогда
		ЗарегистрироватьОшибку("Для команды [" + ИдентификаторКоманды + "] не определены действия.");
	КонецЕсли;
	
	ВариантОтчета = РаботаСКоллекциями.СвойствоСтруктуры(ПараметрыКоманды, "ВариантОтчета"); 
	
	Если Не ЗначениеЗаполнено(ВариантОтчета) Тогда
		
		ЗарегистрироватьОшибку("Для формирования и отправки отчета необходимо заполнить параметр команды [ВариантОтчета].");
		
	Иначе
		
		ПроверяемыеПараметры = Новый Массив;
		ПроверяемыеПараметры.Добавить("Организация");
		
		Если ВариантОтчета = "ПоСделкам" Тогда
			ПроверяемыеПараметры.Добавить("ЦеннаяБумага");
			ПроверяемыеПараметры.Добавить("СчетДоверительногоУправления");
		ИначеЕсли ВариантОтчета = "Доходность" Тогда
			ПроверяемыеПараметры.Добавить("КодыСчетовДоверительногоУправления");
		Иначе
			ЗарегистрироватьОшибку("Для варианта отчета [" + ВариантОтчета + "] не определены действия.");
		КонецЕсли;
		
		Для каждого ПроверяемыйПараметр Из ПроверяемыеПараметры Цикл
		
			Если Не ЗначениеЗаполнено(РаботаСКоллекциями.СвойствоСтруктуры(ПараметрыКоманды, ПроверяемыйПараметр)) Тогда
				ТекстОшибки = СтрШаблон("Для формирования и отправки отчета необходимо заполнить параметр команды [%1].", ПроверяемыйПараметр);
				ЗарегистрироватьОшибку(ТекстОшибки);
			КонецЕсли;		
		
		КонецЦикла;		
		
	КонецЕсли;
	
	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки") Тогда
		СформироватьИОтправитьОтчет(ПараметрыКоманды);
	КонецЕсли;
		
	ОповеститьОбОшибках(Неопределено);
	
КонецПроцедуры

Процедура ЗарегистрироватьОшибку(ТекстОшибки)
	
	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки") Тогда
		ЭтотОбъект.ДополнительныеСвойства.Вставить("Ошибки", Новый Массив());
	КонецЕсли;
	
	// дополним текст ошибки сообщениями пользователю
	МассивСообщений = ПолучитьСообщенияПользователю(Истина);
	Если МассивСообщений.Количество() > 0 Тогда

		ТекстОшибки = ТекстОшибки + Символы.ПС + "Сообщения пользователю:";
		Для Каждого ТекСообщение Из МассивСообщений Цикл
			
			Если ТекСообщение.Текст = "" Тогда
				Продолжить;
			Иначе
				Текст = ТекСообщение.Текст + ". " + Строка(ТекСообщение.КлючДанных);
				ТекстОшибки = ТекстОшибки + Символы.ПС + Текст; 
			КонецЕсли;
			
		КонецЦикла;
	Иначе
		ТекстОшибки = ТекстОшибки;                                  
	КонецЕсли;
	
    Если ЭтотОбъект.ДополнительныеСвойства.Ошибки.Найти(ТекстОшибки) = Неопределено Тогда    	
		ЭтотОбъект.ДополнительныеСвойства.Ошибки.Добавить(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОповеститьОбОшибках(ЕстьОшибки = Неопределено)
	
	ЕстьОшибки = ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки");
	
	Если Не ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("Источник") Тогда
		РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку(ЭтотОбъект.ДополнительныеСвойства.Ошибки, ЭтотОбъект.ДополнительныеСвойства.Источник);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			РаботаСоСтрокамиКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(ЭтотОбъект.ДополнительныеСвойства.Ошибки, Символы.ПС));
	КонецЕсли;
	ЭтотОбъект.ДополнительныеСвойства.Удалить("Ошибки");	
	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНачала", 	ЭтотОбъект.Период.ДатаНачала);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаОкончания", 	ЭтотОбъект.Период.ДатаОкончания);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Организация", 	ЭтотОбъект.Организация);
	
	ПользовательскиеНастройки = КомпоновщикНастроек.ПользовательскиеНастройки;
	КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(ПользовательскиеНастройки);
	
	РаботаСОтчетами.ВыполнитьКомпоновкуПрограммно(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура СформироватьИОтправитьОтчет(Параметры)
	
	Настройки = СхемаКомпоновкиДанных.ВариантыНастроек.Найти(Параметры.ВариантОтчета).Настройки;
	
	Если Параметры.ВариантОтчета = "ПоСделкам" Тогда
		
		ВысотаШапкиТаблицы = 2;
		
		ДатаНачала = НачалоДня(ТекущаяДатаСеанса()) - (24 * 60 * 60);
		ДатаОкончания = КонецДня(ДатаНачала);
		
		ОтборСчетДУ = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборСчетДУ.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СчетДоверительногоУправления");
		ОтборСчетДУ.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ОтборСчетДУ.ПравоеЗначение = Параметры.СчетДоверительногоУправления;
		
		ОтборСчетЦБ = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборСчетЦБ.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЦеннаяБумага");
		ОтборСчетЦБ.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ОтборСчетЦБ.ПравоеЗначение = Параметры.ЦеннаяБумага;
		
	ИначеЕсли Параметры.ВариантОтчета = "Доходность" Тогда
		
		ВысотаШапкиТаблицы = 1;
		
		Календари = Справочники.Календари;
		НачалоДня = НачалоДня(ТекущаяДатаСеанса());
		
		Если НачалоДня <> Календари.ПолучитьБлижайшуюРабочуюДату(Календари.Общероссийский, НачалоДня) Тогда
			// По выходным рассылку не выполняем
			Возврат;
		КонецЕсли;
		
		ДатаОкончания = НачалоДня - 1;
		ДатаНачала = Календари.ПолучитьБлижайшуюРабочуюДату(Календари.Общероссийский, ДатаОкончания);
		
		ОтборСчетДУ = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборСчетДУ.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СчетДоверительногоУправления");
		ОтборСчетДУ.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
		ОтборСчетДУ.ПравоеЗначение = ПолучитьСчетаДУПоКодам(Параметры.КодыСчетовДоверительногоУправления);
				
	КонецЕсли;
	
	КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНачала", ДатаНачала);
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаОкончания", ДатаОкончания);
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Организация", Параметры.Организация);
	
	ДокументРезультат = Новый ТабличныйДокумент;
	РаботаСОтчетами.ВыполнитьКомпоновкуПрограммно(ЭтотОбъект, ДокументРезультат, Неопределено, Истина);
		
	ПараметрыОповещения = Новый Структура("Текст, Вложения", "", Новый Соответствие);
	
	Если ДокументРезультат.ВысотаТаблицы > ВысотаШапкиТаблицы Тогда
		
		Если Параметры.ВариантОтчета = "ПоСделкам" Тогда
			
			ИмяФайла = ПолучитьИмяВременногоФайла("xlsx");
			ДокументРезультат.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
			
			ПараметрыОповещения.Вложения.Вставить("ОтчетПоСделкам.xlsx", Новый Файл(ИмяФайла));	
			ПараметрыОповещения.Текст = "По портфелю совершены сделки. Информация во вложении.";			
		
		ИначеЕсли Параметры.ВариантОтчета = "Доходность" Тогда
			
			ИмяФайла = ПолучитьИмяВременногоФайла("htm");
			ДокументРезультат.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.HTML);
			
			ТекстовыйДокумент = Новый ТекстовыйДокумент;
			ТекстовыйДокумент.Прочитать(ИмяФайла);
			
			УдалитьФайлы(ИмяФайла);
			
			Текст = ТекстовыйДокумент.ПолучитьТекст();
			
			НачалоСтроки = СтрНайти(Текст, "<STYLE");
			Текст = Сред(Текст, НачалоСтроки);
			КонецСтроки = СтрНайти(Текст, "</BODY>")-1;
			Текст = Лев(Текст, КонецСтроки);
			
			НачалоСтроки = СтрНайти(Текст, "<TABLE ");
			КонецСтроки = СтрНайти(Текст, ">", , НачалоСтроки); 

			Текст = Лев(Текст, НачалоСтроки) + "TABLE" + Сред(Текст, КонецСтроки);
			Текст = СтрЗаменить(Текст, "width: 100%;", "");
			Текст = СтрЗаменить(Текст, "padding: 0;", "padding: 3;");
			
			ПараметрыОповещения.Текст = СтрЗаменить(Текст, "width: 100%;", "");
		
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОповещения.Текст) Тогда
		ОтправитьОповещение(Параметры.ВариантОтчета, ПараметрыОповещения);
	КонецЕсли;
	
	Для каждого Вложение Из ПараметрыОповещения.Вложения Цикл
		
		Файл = Вложение.Значение;
		Если Файл.Существует() Тогда
			УдалитьФайлы(Файл.ПолноеИмя);
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтправитьОповещение(ВариантОтчета, ПараметрыОповещения)
	
	ПолноеИмяИсточника = ЭтотОбъект.Метаданные().ПолноеИмя() + "." + ВариантОтчета;
	Справочники.Оповещения.СформироватьОповещения(ПолноеИмяИсточника, Перечисления.ТипыСобытий.ВнешнийВызов, ПараметрыОповещения);
	
КонецПроцедуры

Функция ПолучитьРезультатДляВыгрузкиВExcel() Экспорт
		
	Настройки = КомпоновщикНастроек.Настройки;
	Параметры = Настройки.ПараметрыДанных;
	
	Параметры.УстановитьЗначениеПараметра("ДатаНачала",						ЭтотОбъект.Период.ДатаНачала);
	Параметры.УстановитьЗначениеПараметра("ДатаОкончания",					КонецДня(ЭтотОбъект.Период.ДатаОкончания));
	Параметры.УстановитьЗначениеПараметра("Организация", 					ЭтотОбъект.Организация);
	
	ПолноеИмяОтчета = ЭтотОбъект.Метаданные().ПолноеИмя();
	СессияСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессиюКомпоновкиСКД(ЭтотОбъект, ПолноеИмяОтчета);
	
	// Стандартная компоновка отчета	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(ЭтотОбъект.СхемаКомпоновкиДанных,  ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки(),,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , , Истина);
	                          
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ОбщаяТаблица = Новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(ОбщаяТаблица);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
		
	Если ОбщаяТаблица.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ОбщаяТаблица.Колонки.Найти("ISIN") = Неопределено 
		Или ОбщаяТаблица.Колонки.Найти("СчетДоверительногоУправления") = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В Настройках должны быть выбраны поля 'Счет доверительного управления', 'ISIN'",,,,);
		Возврат Неопределено;
	КонецЕсли;                         
	
	Если ОбщаяТаблица.Колонки.Количество() < 24 Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для заполнения всех колонок файла в Настройках должны быть выбраны поля:" + Символы.ПС + 
			"Код счета"	+ Символы.ПС + 
			"Дата операции" + Символы.ПС + 
			"Время операции" + Символы.ПС + 
			"Дата расчетов" + Символы.ПС + 
			"Вид операции" + Символы.ПС + 
			"Номер сделки" + Символы.ПС + 
			"Рынок" + Символы.ПС + 
			"Эмитент" + Символы.ПС + 
			"Ценная бумага" + Символы.ПС + 
			"Номинал" + Символы.ПС + 
			"Рег. номер" + Символы.ПС + 			
			"Цена" + Символы.ПС + 
			"Цена купона" + Символы.ПС + 
			"Количество" + Символы.ПС + 
			"Сумма" + Символы.ПС + 
			"Количество дней" + Символы.ПС + 
			"Ставка" + Символы.ПС + 
			"Валюта сделки" + Символы.ПС + 
			"Основание" + Символы.ПС + 
			"Комиссия биржи" + Символы.ПС + 
			"Комиссия брокера" + Символы.ПС + 
			"Идентификатор основания",,,,);		
		
	КонецЕсли;
	
	ОбщаяТаблица.Сортировать("ISIN, СчетДоверительногоУправления");
	
	МассивISIN = ОбщаяТаблица.ВыгрузитьКолонку("ISIN");
	РаботаСКоллекциями.УдалитьПовторяющиесяЗначенияМассива(МассивISIN);
	
	СтруктураРезультата = Новый Структура;
		
	Макет = ПолучитьМакет("Макет"); 
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		
	Для Каждого ISIN Из МассивISIN Цикл
		
		ТекРезультат = Новый ТабличныйДокумент;
		ТекРезультат.Вывести(ОбластьШапка);
		
		НайдСтроки = ОбщаяТаблица.НайтиСтроки(Новый Структура("ISIN", ISIN));
		Для Каждого НайдСтрока Из НайдСтроки Цикл
			ОбластьСтрока.Параметры.Заполнить(НайдСтрока);
			ТекРезультат.Вывести(ОбластьСтрока);
		КонецЦикла;
		
		СтруктураРезультата.Вставить(?(ПустаяСтрока(ISIN), "НеЦБ", ISIN), ТекРезультат);
		
	КонецЦикла;
	
	// Завершаем сессию сбора статистики
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(ПолноеИмяОтчета, СессияСбораСтатистики); 	
	
	Возврат СтруктураРезультата;
	
КонецФункции

Функция ПолучитьСчетаДУПоКодам(КодыСчетовДоверительногоУправления)

	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|ГДЕ
		|	СчетаДоверительногоУправления.КодСчета В (&КодыСчетов)";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("КодыСчетов", СтрРазделить(КодыСчетовДоверительногоУправления, ",; ", Ложь));
	
	Результат = Запрос.Выполнить();
	МассивСчетов = Результат.Выгрузить().ВыгрузитьКолонку(0);
	
	Возврат МассивСчетов;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////////////////////
ЭтотОбъект.ДополнительныеСвойства = Новый Структура;
